//Оператори за инкрементация / декрементация

// икрементацип - увеличаване на стойността на променлива
// ++ - специфичен оператор за инкерементация, който увеличава стойността на променливата с 1

// видове инкрементация
//1. пре-икрементация -> ++ преди променливата
//2. пост-инкрементация -> ++ след променливата

int number = 7;

Console.WriteLine(++number); // 8
Console.WriteLine(number++); //8
Console.WriteLine(number); //9

//декрементация - намаляваме стойността на променлива с 1
// –– -> специфичен оператор за декрементация, който намалява стойността на променливата с 1

// видове декрементация
// 1. пре-декрементация -> операторът -- е преди променливата
// 2. пост-декрементация -> операторът -- е след променливата

int age = 26;

Console.WriteLine(--age); // 25
Console.WriteLine(age--);// 25
Console.WriteLine(age); //24

//Пример
int count = 0;
count++;
++count;
Console.WriteLine(count);//2

//Цикли / Loops -> повторение на код
//For цикъл -> определен брой повторениящ  / знаем колко пъти искаме да повторим дадено нещо

//Пример : от 1 до 100 -> използваме for цикъл
//1. Начало -> 1
//2. Край -> 100
//3. Какво повтаряме -> отпечатваме число
//4 Промяна -> +1

